#language: ru

@tree

Функционал: <описание фичи>

Как <Роль> я хочу
<описание функционала> 
чтобы <бизнес-эффект>   

Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий

Сценарий: Тест веб сервиса

	И в поле с именем 'ПроверитьГод' я ввожу текст '2012'

	И Я запоминаю в переменную "СоединениеУстановлено" значение "Нет"
	И я делаю 2 раза
		Попытка
			И я нажимаю на кнопку с именем 'ФормаПолучитьДанные'
			Тогда элемент формы с именем "ГодВысокосный" стал равен 'Да'
			И Я запоминаю в переменную "СоединениеУстановлено" значение "Да"
			Тогда я прерываю цикл
		Исключение
			И Пауза 10
	Если переменная "СоединениеУстановлено" имеет значение "Нет" Тогда
		Затем я останавливаю выполнение сценария "Skipped"
	
Сценарий: тест

	Попытка 
		И Я подключаю клиент тестирования "ИмяПрофиляTestClient1" из таблицы клиентов тестирования
	Исключение	
		И я регистрирую ошибку "Нет тест клиента 1" по данным исключения

	И Пауза 2

	Попытка 
		И Я подключаю клиент тестирования "ИмяПрофиляTestClient3" из таблицы клиентов тестирования
	Исключение	
		И я регистрирую ошибку "Нет тест клиента 2" по данным исключения	
		