#language: ru

@tree

Функционал: <описание фичи>

Как <Роль> я хочу
<описание функционала> 
чтобы <бизнес-эффект>   

Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий

Сценарий: Изменение количества во всех строках таблицы

	И для каждой строки таблицы "ItemList" я выполняю используя колонку "N"
		И в таблице "ItemList" в поле "Количество" я ввожу текст "10,000"
		
Сценарий: Удаление строк таблицы

	И пока в таблице "ItemList" количество строк ">" 0 Тогда
		И в таблице "ItemList" я удаляю строку
		
Сценарий: Изменение вида цен по условиям

	И для каждой строки таблицы "ItemList" я выполняю
		Если таблица "ItemList" содержит строки Тогда
			| 'Номенклатура'             | 'Характеристика' | 'Вид цены'          |
			| 'Товар с характеристиками' | 'S/Красный'      | 'Цена поставщика 1' |
			И в таблице "ItemList" я перехожу к строке:
				| 'N' | 'Вид цены'          | 'Ед. изм.' | 'Заказ поставщику'                         | 'Используется приходная товарная накладная' | 'Количество' | 'НДС' | 'Не рассчитывать строки' | 'Номенклатура'             | 'Общая сумма' | 'Склад'                         | 'Сумма без налогов' | 'Сумма налогов' | 'Характеристика' | 'Цена'   |
				| '1' | 'Цена поставщика 1' | 'шт'       | 'Заказ поставщику 1 от 01.02.2021 9:49:47' | 'Да'                                        | '50,000'     | '20%' | 'Нет'                    | 'Товар с характеристиками' | '5 500,00'    | 'Склад 1 (с контролем остатка)' | '4 583,33'          | '916,67'        | 'S/Красный'      | '110,00' |
			И в таблице "ItemList" я выбираю текущую строку
			И в таблице "ItemList" я нажимаю кнопку выбора у реквизита с именем "ItemListPriceType"
			Тогда открылось окно 'Виды цен'
			И в таблице "List" я перехожу к строке:
				| 'Валюта' | 'Код' | 'Наименование'      | 'Ссылка'            |
				| 'USD'    | '4'   | 'Цена поставщика 2' | 'Цена поставщика 2' |
			И в таблице "List" я активизирую поле с именем "Description"
			И в таблице "List" я выбираю текущую строку
		
		И таблица  "ItemList" не содержит строки:
			| 'Номенклатура'             | 'Характеристика' | 'Вид цены'          |
			| 'Товар с характеристиками' | 'S/Красный'      | 'Цена поставщика 1' |

Сценарий: Перебор элементов справочника Номенклатура

	И для каждой строки таблицы "List" я выполняю
		И в таблице "List" я выбираю текущую строку
		Тогда не появилось окно предупреждения системы
		И я закрываю текущее окно

Сценарий: Создание большого объема данных (справочник ед. изм.)

	И Я запоминаю значение выражения '1' в переменную "Шаг"
	И я делаю 10 раз 
		И Я запоминаю значение выражения '$Шаг$ + 1' в переменную "Шаг"
		И Я запоминаю значение выражения '"ед.изм." + $Шаг$' в переменную "ЕдиницаИзмерения"
		И я проверяю или создаю для справочника "Units" объекты:
		| 'Ref'                                                           | 'DeletionMark' | 'Code' | 'Item' | 'Quantity' | 'BasisUnit' | 'UOM' | 'Description_en' | 'Description_hash' | 'Description_ru' | 'Description_tr' | 'Height' | 'Length' | 'Volume' | 'Weight' | 'Width' |
		| '{"e1cib/data/Catalog.Units?ref=" + StrReplace(New UUID,"-","")}' | 'False'        |''       | ''     | 1          | ''          | ''    | '$ЕдиницаИзмерения$'             | ''                 | ''               | ''               |          |          |          |          |         |


		
	
		
		
	
					

		
					
	



