#language: ru

@tree
@БыстрыеПроверки

Функционал: Проверка функциональной опции Использовать орагнизацию

Как Тестировщик я хочу
проверить отображение поля Организация при выключении и выключении функциональной опции Использовать орагнизацию
чтобы проверить, что пользователь не ошибется при вводе данных  

Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий

Сценарий: Проверка функциональной опции Использовать орагнизацию

И я устанавливаю в константу "UseCompanies" значение "False"
И В командном интерфейсе я выбираю 'Продажи' 'Заказы покупателей'
Тогда открылось окно 'Заказы покупателей'
И я нажимаю на кнопку с именем 'FormCreate'
И элемент формы "Организация" отсутствует на форме
