#language: ru

@tree
@ExportScenarios
@IgnoreOnCIMainBuild

Функционал: Заполнение таблицы "Товары" и проверка Количество (итог) для документа "Заказ"

Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий

@ТипШага: Проверка документа
@Описание: Сценарий заполняет таблицу "Товары" документа "Заказ" и проверяет Количество (итог)
@ПримерИспользования: И Заполнение таблицы Товары и проверка Количество (итог)
Сценарий: Заполнение таблицы Товары и проверка Количество (итог)

* Очистка таблицы перед проверкой
	И я удаляю все строки таблицы "Товары"
* Порверка при добавлении строки	
//	Когда открылось окно 'Заказ (создание) *'
	И в таблице "Товары" я нажимаю на кнопку с именем 'ТоварыДобавить'
	И в таблице "Товары" я нажимаю кнопку выбора у реквизита с именем "ТоварыТовар"
	Тогда открылось окно 'Товары'
	И в таблице "Список" я разворачиваю строку:
		| 'Код'       | 'Наименование' |
		| '000000011' | 'Продукты'     |
	И в таблице "Список" я разворачиваю строку:
		| 'Код'       | 'Наименование' |
		| '000000099' | 'Молочные'     |
	И в таблице "Список" я перехожу к строке:
		| 'Код'       | 'Наименование' |
		| '000000021' | 'Масло'        |
	И в таблице "Список" я выбираю текущую строку
	Тогда открылось окно 'Заказ (создание) *'
	И в таблице "Товары" из выпадающего списка с именем "ТоварыТовар" я выбираю точное значение 'Масло'
	И в таблице "Товары" я завершаю редактирование строки
	И в таблице "Товары" я нажимаю на кнопку с именем 'ТоварыДобавить'
	И в таблице "Товары" я нажимаю кнопку выбора у реквизита с именем "ТоварыТовар"
	Тогда открылось окно 'Товары'
	И в таблице "Список" я разворачиваю строку:
		| 'Код'       | 'Наименование' |
		| '000000011' | 'Продукты'     |
	И в таблице "Список" я разворачиваю строку:
		| 'Код'       | 'Наименование' |
		| '000000099' | 'Молочные'     |
	И в таблице "Список" я перехожу к строке:
		| 'Код'       | 'Наименование' |
		| '000000027' | 'Ряженка'      |
	И в таблице "Список" я выбираю текущую строку
	Тогда открылось окно 'Заказ (создание) *'
	И в таблице "Товары" из выпадающего списка с именем "ТоварыТовар" я выбираю точное значение 'Ряженка'
	И в таблице "Товары" я завершаю редактирование строки

	Тогда элемент формы с именем "ТоварыИтогКоличество" стал равен '2'

* Порверка при изменении данных строки	
	И в таблице "Товары" я перехожу к строке:
		| 'Количество' | 'Сумма'  | 'Товар'   | 'Цена'   |
		| '1'          | '40,00'  | 'Масло'   | '40,00'  |
	И в таблице "Товары" я активизирую поле с именем "ТоварыКоличество"
	И в таблице "Товары" я выбираю текущую строку
	И в таблице "Товары" в поле с именем 'ТоварыКоличество' я ввожу текст '2'
	И в таблице "Товары" я завершаю редактирование строки
	
	Тогда элемент формы с именем "ТоварыИтогКоличество" стал равен '3'
	
	И в таблице "Товары" я перехожу к строке:
		| 'Количество' | 'Сумма' | 'Товар'    | 'Цена'  |
		| '1'          | '55,00' | 'Ряженка'  | '55,00' |
	И в таблице "Товары" я выбираю текущую строку
	И в таблице "Товары" в поле с именем 'ТоварыКоличество' я ввожу текст '4'
	И в таблице "Товары" я завершаю редактирование строки
	
	Тогда элемент формы с именем "ТоварыИтогКоличество" стал равен '6'			

* Проверка при удалении строки
	И в таблице "Товары" я активизирую поле с именем "ТоварыТовар"
	И в таблице 'Товары' я удаляю строку
	
	Тогда элемент формы с именем "ТоварыИтогКоличество" стал равен '2'
