#language: ru

@tree

Функционал: Проверка добавления картинок в справочник Номенлкатура

Как Менеджер я хочу
добавить картинки к номенклатуре
чтобы можно было посмотреть как выглядит товар   

Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий

Сценарий: _0601 Подготовительный (Добавление картинок)
	Когда Экспорт основных данных
	Когда Экспорт настроек картинок
	//И Я устанавливаю в данную базу расширение "IRP_TestExtension.cfe" из каталога исходников "$КаталогПроекта$\Features_IRP\Additional"

	И я закрываю TestClient "Этот клиент"
	И Я устанавливаю в базу расширение из файла "$КаталогПроекта$\Features_IRP\Additional\IRP_TestExtension.cfe"
	И я подключаю профиль TestClient "Этот клиент"	

Сценарий: _0602 Проверка добавления картинки	
	Дано Я открываю навигационную ссылку "e1cib/data/Catalog.Items?ref=b762b13668d0905011eb76684b9f687d"
	И я выбираю файл "$КаталогПроекта$\Features_IRP\Files\itempicture1.png" 
	И я делаю клик по элементу клиента тестирования '+' '' UI Automation
	И я нажимаю на кнопку с именем 'update_slider'
